china-djyos/djyos/third/firmware/bk7251drv3.0/func/hostapd-2.5/src/common/ieee802_11_defs.h
/* Action frame categories (IEEE 802.11-2007, 7.3.1.11, Table 7-24) */
#define WLAN_ACTION_SPECTRUM_MGMT 0
#define WLAN_ACTION_QOS 1
#define WLAN_ACTION_DLS 2
#define WLAN_ACTION_BLOCK_ACK 3
#define WLAN_ACTION_PUBLIC 4
#define WLAN_ACTION_RADIO_MEASUREMENT 5
#define WLAN_ACTION_FT 6
#define WLAN_ACTION_HT 7
#define WLAN_ACTION_SA_QUERY 8
#define WLAN_ACTION_PROTECTED_DUAL 9
#define WLAN_ACTION_WNM 10
#define WLAN_ACTION_UNPROTECTED_WNM 11
#define WLAN_ACTION_TDLS 12
#define WLAN_ACTION_SELF_PROTECTED 15
#define WLAN_ACTION_WMM 17 /* WMM Specification 1.1 */
#define WLAN_ACTION_FST 18
#define WLAN_ACTION_VENDOR_SPECIFIC 127

/* Public action codes */
#define WLAN_PA_20_40_BSS_COEX 0
#define WLAN_PA_VENDOR_SPECIFIC 9
#define WLAN_PA_GAS_INITIAL_REQ 10
#define WLAN_PA_GAS_INITIAL_RESP 11
#define WLAN_PA_GAS_COMEBACK_REQ 12
#define WLAN_PA_GAS_COMEBACK_RESP 13
#define WLAN_TDLS_DISCOVERY_RESPONSE 14

/* Protected Dual of Public Action frames */
#define WLAN_PROT_DSE_ENABLEMENT 1
#define WLAN_PROT_DSE_DEENABLEMENT 2
#define WLAN_PROT_EXT_CSA 4
#define WLAN_PROT_MEASUREMENT_REQ 5
#define WLAN_PROT_MEASUREMENT_REPORT 6
#define WLAN_PROT_DSE_POWER_CONSTRAINT 8
#define WLAN_PROT_VENDOR_SPECIFIC 9
#define WLAN_PROT_GAS_INITIAL_REQ 10
#define WLAN_PROT_GAS_INITIAL_RESP 11
#define WLAN_PROT_GAS_COMEBACK_REQ 12
#define WLAN_PROT_GAS_COMEBACK_RESP 13

/* SA Query Action frame (IEEE 802.11w/D8.0, 7.4.9) */
#define WLAN_SA_QUERY_REQUEST 0
#define WLAN_SA_QUERY_RESPONSE 1

#define WLAN_SA_QUERY_TR_ID_LEN 2

/* TDLS action codes */
#define WLAN_TDLS_SETUP_REQUEST 0
#define WLAN_TDLS_SETUP_RESPONSE 1
#define WLAN_TDLS_SETUP_CONFIRM 2
#define WLAN_TDLS_TEARDOWN 3
#define WLAN_TDLS_PEER_TRAFFIC_INDICATION 4
#define WLAN_TDLS_CHANNEL_SWITCH_REQUEST 5
#define WLAN_TDLS_CHANNEL_SWITCH_RESPONSE 6
#define WLAN_TDLS_PEER_PSM_REQUEST 7
#define WLAN_TDLS_PEER_PSM_RESPONSE 8
#define WLAN_TDLS_PEER_TRAFFIC_RESPONSE 9
#define WLAN_TDLS_DISCOVERY_REQUEST 10

/* Radio Measurement Action codes */
#define WLAN_RRM_RADIO_MEASUREMENT_REQUEST 0
#define WLAN_RRM_RADIO_MEASUREMENT_REPORT 1
#define WLAN_RRM_LINK_MEASUREMENT_REQUEST 2
#define WLAN_RRM_LINK_MEASUREMENT_REPORT 3
#define WLAN_RRM_NEIGHBOR_REPORT_REQUEST 4
#define WLAN_RRM_NEIGHBOR_REPORT_RESPONSE 5

/* Radio Measurement capabilities (from RRM Capabilities IE) */
/* byte 1 (out of 5) */
#define WLAN_RRM_CAPS_LINK_MEASUREMENT BIT(0)
#define WLAN_RRM_CAPS_NEIGHBOR_REPORT BIT(1)

/* Timeout Interval Type */
#define WLAN_TIMEOUT_REASSOC_DEADLINE 1
#define WLAN_TIMEOUT_KEY_LIFETIME 2
#define WLAN_TIMEOUT_ASSOC_COMEBACK 3

/* Interworking element (IEEE 802.11u) - Access Network Options */
#define INTERWORKING_ANO_ACCESS_NETWORK_MASK 0x0f
#define INTERWORKING_ANO_INTERNET 0x10
#define INTERWORKING_ANO_ASRA 0x20
#define INTERWORKING_ANO_ESR 0x40
#define INTERWORKING_ANO_UESA 0x80

#define INTERWORKING_ANT_PRIVATE 0
#define INTERWORKING_ANT_PRIVATE_WITH_GUEST 1
#define INTERWORKING_ANT_CHARGEABLE_PUBLIC 2
#define INTERWORKING_ANT_FREE_PUBLIC 3
#define INTERWORKING_ANT_PERSONAL_DEVICE 4
#define INTERWORKING_ANT_EMERGENCY_SERVICES 5
#define INTERWORKING_ANT_TEST 6
#define INTERWORKING_ANT_WILDCARD 15

/* Advertisement Protocol ID definitions (IEEE Std 802.11u-2011) */
enum adv_proto_id {
    ACCESS_NETWORK_QUERY_PROTOCOL = 0,
    MIH_INFO_SERVICE = 1,
    MIH_CMD_AND_EVENT_DISCOVERY = 2,
    EMERGENCY_ALERT_SYSTEM = 3,
    ADV_PROTO_VENDOR_SPECIFIC = 221
};

/* Access Network Query Protocol info ID definitions (IEEE Std 802.11u-2011) */
enum anqp_info_id {
    ANQP_QUERY_LIST = 256,
    ANQP_CAPABILITY_LIST = 257,
    ANQP_VENUE_NAME = 258,
    ANQP_EMERGENCY_CALL_NUMBER = 259,
    ANQP_NETWORK_AUTH_TYPE = 260,
    ANQP_ROAMING_CONSORTIUM = 261,
    ANQP_IP_ADDR_TYPE_AVAILABILITY = 262,
    ANQP_NAI_REALM = 263,
    ANQP_3GPP_CELLULAR_NETWORK = 264,
    ANQP_AP_GEOSPATIAL_LOCATION = 265,
    ANQP_AP_CIVIC_LOCATION = 266,
    ANQP_AP_LOCATION_PUBLIC_URI = 267,
    ANQP_DOMAIN_NAME = 268,
    ANQP_EMERGENCY_ALERT_URI = 269,
    ANQP_EMERGENCY_NAI = 271,
    ANQP_VENDOR_SPECIFIC = 56797
};

/* NAI Realm list - EAP Method subfield - Authentication Parameter ID */
enum nai_realm_eap_auth_param {
    NAI_REALM_EAP_AUTH_EXPANDED_EAP_METHOD = 1,
    NAI_REALM_EAP_AUTH_NON_EAP_INNER_AUTH = 2,
    NAI_REALM_EAP_AUTH_INNER_AUTH_EAP_METHOD = 3,
    NAI_REALM_EAP_AUTH_EXPANDED_INNER_EAP_METHOD = 4,
    NAI_REALM_EAP_AUTH_CRED_TYPE = 5,
    NAI_REALM_EAP_AUTH_TUNNELED_CRED_TYPE = 6,
    NAI_REALM_EAP_AUTH_VENDOR_SPECIFIC = 221
};

enum nai_realm_eap_auth_inner_non_eap {
    NAI_REALM_INNER_NON_EAP_PAP = 1,
    NAI_REALM_INNER_NON_EAP_CHAP = 2,
    NAI_REALM_INNER_NON_EAP_MSCHAP = 3,
    NAI_REALM_INNER_NON_EAP_MSCHAPV2 = 4
};

enum nai_realm_eap_cred_type {
    NAI_REALM_CRED_TYPE_SIM = 1,
    NAI_REALM_CRED_TYPE_USIM = 2,
    NAI_REALM_CRED_TYPE_NFC_SECURE_ELEMENT = 3,
    NAI_REALM_CRED_TYPE_HARDWARE_TOKEN = 4,
    NAI_REALM_CRED_TYPE_SOFTOKEN = 5,
    NAI_REALM_CRED_TYPE_CERTIFICATE = 6,
    NAI_REALM_CRED_TYPE_USERNAME_PASSWORD = 7,
    NAI_REALM_CRED_TYPE_NONE = 8,
    NAI_REALM_CRED_TYPE_ANONYMOUS = 9,
    NAI_REALM_CRED_TYPE_VENDOR_SPECIFIC = 10
};

#ifdef _MSC_VER
#pragma pack(push, 1)
#endif /* _MSC_VER */

STRUCT_PACKED struct ieee80211_hdr {
    le16 frame_control;
    le16 duration_id;
    u8 addr1[6];
    u8 addr2[6];
    u8 addr3[6];
    le16 seq_ctrl;
    /* followed by 'u8 addr4[6];' if ToDS and FromDS is set in data frame
     */
}GCC_PACKED;

#define IEEE80211_DA_FROMDS addr1
#define IEEE80211_BSSID_FROMDS addr2
#define IEEE80211_SA_FROMDS addr3

#define IEEE80211_HDRLEN (sizeof(struct ieee80211_hdr))

#define IEEE80211_FC(type, stype) host_to_le16((type << 2) | (stype << 4))

#define VARIABLE_ARRAY_SPARE                   1

STRUCT_PACKED struct ieee80211_mgmt {
    le16 frame_control;
    le16 duration;
    u8 da[6];
    u8 sa[6];
    u8 bssid[6];
    le16 seq_ctrl;

    STRUCT_PACKED union {
        STRUCT_PACKED struct {
            le16 auth_alg;
            le16 auth_transaction;
            le16 status_code;
            /* possibly followed by Challenge text */
            u8 variable[1];
        }GCC_PACKED auth;

        STRUCT_PACKED struct {
            le16 reason_code;
            u8 variable[1];
        }GCC_PACKED deauth;

        STRUCT_PACKED struct {
            le16 capab_info;
            le16 listen_interval;
            /* followed by SSID and Supported rates */
            u8 variable[1];
        }GCC_PACKED assoc_req;

        STRUCT_PACKED struct {
            le16 capab_info;
            le16 status_code;
            le16 aid;
            /* followed by Supported rates */
            u8 variable[1];
        }GCC_PACKED assoc_resp, reassoc_resp;

        STRUCT_PACKED struct {
            le16 capab_info;
            le16 listen_interval;
            u8 current_ap[6];
            /* followed by SSID and Supported rates */
            u8 variable[1];
        }GCC_PACKED reassoc_req;

        STRUCT_PACKED struct {
            le16 reason_code;
            u8 variable[1];
        }GCC_PACKED disassoc;

        STRUCT_PACKED struct {
            u8 timestamp[8];
            le16 beacon_int;
            le16 capab_info;
            /* followed by some of SSID, Supported rates,
             * FH Params, DS Params, CF Params, IBSS Params, TIM */
            u8 variable[1];
        }GCC_PACKED beacon;

        STRUCT_PACKED struct {
            /* only variable items: SSID, Supported rates */
            u8 variable[1];
        }GCC_PACKED probe_req;

        STRUCT_PACKED struct {
            u8 timestamp[8];
            le16 beacon_int;
            le16 capab_info;
            /* followed by some of SSID, Supported rates,
.            * FH Params, DS Params, CF Params, IBSS Params */
            u8 variable[1];
        }GCC_PACKED probe_resp;

        STRUCT_PACKED struct {
            u8 category;
            STRUCT_PACKED union {
                STRUCT_PACKED struct {
                    u8 action_code;
                    u8 dialog_token;
                    u8 status_code;
                    u8 variable[1];
                }GCC_PACKED wmm_action;

                STRUCT_PACKED struct{
                    u8 action_code;
                    u8 element_id;
                    u8 length;
                    u8 switch_mode;
                    u8 new_chan;
                    u8 switch_count;
                }GCC_PACKED chan_switch;

                STRUCT_PACKED struct {
                    u8 action;
                    u8 sta_addr[ETH_ALEN];
                    u8 target_ap_addr[ETH_ALEN];
                    u8 variable[1];
                }GCC_PACKED ft_action_req;

                STRUCT_PACKED struct {
                    u8 action;
                    u8 sta_addr[ETH_ALEN];
                    u8 target_ap_addr[ETH_ALEN];
                    le16 status_code;
                    u8 variable[1];
                }GCC_PACKED ft_action_resp;

                STRUCT_PACKED struct {
                    u8 action;
                    u8 trans_id[WLAN_SA_QUERY_TR_ID_LEN];
                }GCC_PACKED sa_query_req;

                STRUCT_PACKED struct {
                    u8 action; /* */
                    u8 trans_id[WLAN_SA_QUERY_TR_ID_LEN];
                }GCC_PACKED sa_query_resp;

                STRUCT_PACKED struct {
                    u8 action;
                    u8 dialogtoken;
                    u8 variable[1];
                }GCC_PACKED wnm_sleep_req;

                STRUCT_PACKED struct {
                    u8 action;
                    u8 dialogtoken;
                    le16 keydata_len;
                    u8 variable[1];
                }GCC_PACKED wnm_sleep_resp;

                STRUCT_PACKED struct {
                    u8 action;
                    u8 variable[1];
                }GCC_PACKED public_action;

                STRUCT_PACKED struct {
                    u8 action; /* 9 */
                    u8 oui[3];
                    /* Vendor-specific content */
                    u8 variable[1];
                }GCC_PACKED vs_public_action;

                STRUCT_PACKED struct {
                    u8 action; /* 7 */
                    u8 dialog_token;
                    u8 req_mode;
                    le16 disassoc_timer;
                    u8 validity_interval;
                    /* BSS Termination Duration (optional),
                     * Session Information URL (optional),
                     * BSS Transition Candidate List
                     * Entries */
                    u8 variable[1];
                }GCC_PACKED bss_tm_req;

                STRUCT_PACKED struct {
                    u8 action; /* 8 */
                    u8 dialog_token;
                    u8 status_code;
                    u8 bss_termination_delay;
                    /* Target BSSID (optional),
                     * BSS Transition Candidate List
                     * Entries (optional) */
                    u8 variable[1];
                }GCC_PACKED bss_tm_resp;

                STRUCT_PACKED struct {
                    u8 action; /* 6 */
                    u8 dialog_token;
                    u8 query_reason;
                    /* BSS Transition Candidate List
                     * Entries (optional) */
                    u8 variable[1];
                }GCC_PACKED bss_tm_query;

                STRUCT_PACKED struct {
                    u8 action; /* 15 */
                    u8 variable[1];
                }GCC_PACKED slf_prot_action;

                STRUCT_PACKED struct {
                    u8 action;
                    u8 variable[1];
                }GCC_PACKED fst_action;
            }GCC_PACKED u;

        }GCC_PACKED action;
    }GCC_PACKED u;
}GCC_PACKED;


