china-djyos/djyos/third/firmware/bk7251drv3.0/func/hostapd-2.5/src/common/ieee802_11_defs.h
#define WMM_QOSINFO_STA_AC_MASK 0x0f
#define WMM_QOSINFO_STA_SP_MASK 0x03
#define WMM_QOSINFO_STA_SP_SHIFT 5

#define WMM_AC_AIFSN_MASK 0x0f
#define WMM_AC_AIFNS_SHIFT 0
#define WMM_AC_ACM 0x10
#define WMM_AC_ACI_MASK 0x60
#define WMM_AC_ACI_SHIFT 5

#define WMM_AC_ECWMIN_MASK 0x0f
#define WMM_AC_ECWMIN_SHIFT 0
#define WMM_AC_ECWMAX_MASK 0xf0
#define WMM_AC_ECWMAX_SHIFT 4

STRUCT_PACKED struct wmm_ac_parameter {
    u8 aci_aifsn; /* AIFSN, ACM, ACI */
    u8 cw; /* ECWmin, ECWmax (CW = 2^ECW - 1) */
    le16 txop_limit;
}GCC_PACKED;

/*
 * WMM Parameter Element (used in Beacon, Probe Response, and (Re)Association
 * Response frmaes)
 */
STRUCT_PACKED struct wmm_parameter_element {
    /* Element ID: 221 (0xdd); Length: 24 */
    /* required fields for WMM version 1 */
    u8 oui[3]; /* 00:50:f2 */
    u8 oui_type; /* 2 */
    u8 oui_subtype; /* 1 */
    u8 version; /* 1 for WMM version 1.0 */
    u8 qos_info; /* AP/STA specific QoS info */
    u8 reserved; /* 0 */
    struct wmm_ac_parameter ac[4]; /* AC_BE, AC_BK, AC_VI, AC_VO */

}GCC_PACKED;

/* WMM TSPEC Element */
STRUCT_PACKED struct wmm_tspec_element {
    u8 eid; /* 221 = 0xdd */
    u8 length; /* 6 + 55 = 61 */
    u8 oui[3]; /* 00:50:f2 */
    u8 oui_type; /* 2 */
    u8 oui_subtype; /* 2 */
    u8 version; /* 1 */
    /* WMM TSPEC body (55 octets): */
    u8 ts_info[3];
    le16 nominal_msdu_size;
    le16 maximum_msdu_size;
    le32 minimum_service_interval;
    le32 maximum_service_interval;
    le32 inactivity_interval;
    le32 suspension_interval;
    le32 service_start_time;
    le32 minimum_data_rate;
    le32 mean_data_rate;
    le32 peak_data_rate;
    le32 maximum_burst_size;
    le32 delay_bound;
    le32 minimum_phy_rate;
    le16 surplus_bandwidth_allowance;
    le16 medium_time;
}GCC_PACKED;


/* Access Categories / ACI to AC coding */
enum wmm_ac {
    WMM_AC_BE = 0 /* Best Effort */,
    WMM_AC_BK = 1 /* Background */,
    WMM_AC_VI = 2 /* Video */,
    WMM_AC_VO = 3 /* Voice */,
    WMM_AC_NUM = 4
};


#define HS20_INDICATION_OUI_TYPE 16
#define HS20_ANQP_OUI_TYPE 17
#define HS20_OSEN_OUI_TYPE 18
#define HS20_STYPE_QUERY_LIST 1
#define HS20_STYPE_CAPABILITY_LIST 2
#define HS20_STYPE_OPERATOR_FRIENDLY_NAME 3
#define HS20_STYPE_WAN_METRICS 4
#define HS20_STYPE_CONNECTION_CAPABILITY 5
#define HS20_STYPE_NAI_HOME_REALM_QUERY 6
#define HS20_STYPE_OPERATING_CLASS 7
#define HS20_STYPE_OSU_PROVIDERS_LIST 8
#define HS20_STYPE_ICON_REQUEST 10
#define HS20_STYPE_ICON_BINARY_FILE 11

#define HS20_DGAF_DISABLED 0x01
#define HS20_PPS_MO_ID_PRESENT 0x02
#define HS20_ANQP_DOMAIN_ID_PRESENT 0x04
#define HS20_VERSION 0x10 /* Release 2 */

/* WNM-Notification WFA vendors specific subtypes */
#define HS20_WNM_SUB_REM_NEEDED 0
#define HS20_WNM_DEAUTH_IMMINENT_NOTICE 1

#define HS20_DEAUTH_REASON_CODE_BSS 0
#define HS20_DEAUTH_REASON_CODE_ESS 1

/* Wi-Fi Direct (P2P) */

#define P2P_OUI_TYPE 9

enum p2p_attr_id {
    P2P_ATTR_STATUS = 0,
    P2P_ATTR_MINOR_REASON_CODE = 1,
    P2P_ATTR_CAPABILITY = 2,
    P2P_ATTR_DEVICE_ID = 3,
    P2P_ATTR_GROUP_OWNER_INTENT = 4,
    P2P_ATTR_CONFIGURATION_TIMEOUT = 5,
    P2P_ATTR_LISTEN_CHANNEL = 6,
    P2P_ATTR_GROUP_BSSID = 7,
    P2P_ATTR_EXT_LISTEN_TIMING = 8,
    P2P_ATTR_INTENDED_INTERFACE_ADDR = 9,
    P2P_ATTR_MANAGEABILITY = 10,
    P2P_ATTR_CHANNEL_LIST = 11,
    P2P_ATTR_NOTICE_OF_ABSENCE = 12,
    P2P_ATTR_DEVICE_INFO = 13,
    P2P_ATTR_GROUP_INFO = 14,
    P2P_ATTR_GROUP_ID = 15,
    P2P_ATTR_INTERFACE = 16,
    P2P_ATTR_OPERATING_CHANNEL = 17,
    P2P_ATTR_INVITATION_FLAGS = 18,
    P2P_ATTR_OOB_GO_NEG_CHANNEL = 19,
    P2P_ATTR_SERVICE_HASH = 21,
    P2P_ATTR_SESSION_INFORMATION_DATA = 22,
    P2P_ATTR_CONNECTION_CAPABILITY = 23,
    P2P_ATTR_ADVERTISEMENT_ID = 24,
    P2P_ATTR_ADVERTISED_SERVICE = 25,
    P2P_ATTR_SESSION_ID = 26,
    P2P_ATTR_FEATURE_CAPABILITY = 27,
    P2P_ATTR_PERSISTENT_GROUP = 28,
    P2P_ATTR_VENDOR_SPECIFIC = 221
};

#define P2P_MAX_GO_INTENT 15

/* P2P Capability - Device Capability bitmap */
#define P2P_DEV_CAPAB_SERVICE_DISCOVERY BIT(0)
#define P2P_DEV_CAPAB_CLIENT_DISCOVERABILITY BIT(1)
#define P2P_DEV_CAPAB_CONCURRENT_OPER BIT(2)
#define P2P_DEV_CAPAB_INFRA_MANAGED BIT(3)
#define P2P_DEV_CAPAB_DEVICE_LIMIT BIT(4)
#define P2P_DEV_CAPAB_INVITATION_PROCEDURE BIT(5)

/* P2P Capability - Group Capability bitmap */
#define P2P_GROUP_CAPAB_GROUP_OWNER BIT(0)
#define P2P_GROUP_CAPAB_PERSISTENT_GROUP BIT(1)
#define P2P_GROUP_CAPAB_GROUP_LIMIT BIT(2)
#define P2P_GROUP_CAPAB_INTRA_BSS_DIST BIT(3)
#define P2P_GROUP_CAPAB_CROSS_CONN BIT(4)
#define P2P_GROUP_CAPAB_PERSISTENT_RECONN BIT(5)
#define P2P_GROUP_CAPAB_GROUP_FORMATION BIT(6)
#define P2P_GROUP_CAPAB_IP_ADDR_ALLOCATION BIT(7)

/* P2PS Coordination Protocol Transport Bitmap */
#define P2PS_FEATURE_CAPAB_UDP_TRANSPORT BIT(0)
#define P2PS_FEATURE_CAPAB_MAC_TRANSPORT BIT(1)

STRUCT_PACKED struct p2ps_feature_capab {
    u8 cpt;
    u8 reserved;
}GCC_PACKED;

/* Invitation Flags */
#define P2P_INVITATION_FLAGS_TYPE BIT(0)

/* P2P Manageability */
#define P2P_MAN_DEVICE_MANAGEMENT BIT(0)
#define P2P_MAN_CROSS_CONNECTION_PERMITTED BIT(1)
#define P2P_MAN_COEXISTENCE_OPTIONAL BIT(2)

enum p2p_status_code {
    P2P_SC_SUCCESS = 0,
    P2P_SC_FAIL_INFO_CURRENTLY_UNAVAILABLE = 1,
    P2P_SC_FAIL_INCOMPATIBLE_PARAMS = 2,
    P2P_SC_FAIL_LIMIT_REACHED = 3,
    P2P_SC_FAIL_INVALID_PARAMS = 4,
    P2P_SC_FAIL_UNABLE_TO_ACCOMMODATE = 5,
    P2P_SC_FAIL_PREV_PROTOCOL_ERROR = 6,
    P2P_SC_FAIL_NO_COMMON_CHANNELS = 7,
    P2P_SC_FAIL_UNKNOWN_GROUP = 8,
    P2P_SC_FAIL_BOTH_GO_INTENT_15 = 9,
    P2P_SC_FAIL_INCOMPATIBLE_PROV_METHOD = 10,
    P2P_SC_FAIL_REJECTED_BY_USER = 11,
    P2P_SC_SUCCESS_DEFERRED = 12,
};

enum p2p_role_indication {
    P2P_DEVICE_NOT_IN_GROUP = 0x00,
    P2P_CLIENT_IN_A_GROUP = 0x01,
    P2P_GO_IN_A_GROUP = 0x02,
};

#define P2P_WILDCARD_SSID "DIRECT-"
#define P2P_WILDCARD_SSID_LEN 7

/* P2P action frames */
enum p2p_act_frame_type {
    P2P_NOA = 0,
    P2P_PRESENCE_REQ = 1,
    P2P_PRESENCE_RESP = 2,
    P2P_GO_DISC_REQ = 3
};

/* P2P public action frames */
enum p2p_action_frame_type {
    P2P_GO_NEG_REQ = 0,
    P2P_GO_NEG_RESP = 1,
    P2P_GO_NEG_CONF = 2,
    P2P_INVITATION_REQ = 3,
    P2P_INVITATION_RESP = 4,
    P2P_DEV_DISC_REQ = 5,
    P2P_DEV_DISC_RESP = 6,
    P2P_PROV_DISC_REQ = 7,
    P2P_PROV_DISC_RESP = 8
};

enum p2p_service_protocol_type {
    P2P_SERV_ALL_SERVICES = 0,
    P2P_SERV_BONJOUR = 1,
    P2P_SERV_UPNP = 2,
    P2P_SERV_WS_DISCOVERY = 3,
    P2P_SERV_WIFI_DISPLAY = 4,
    P2P_SERV_P2PS = 11,
    P2P_SERV_VENDOR_SPECIFIC = 255
};

enum p2p_sd_status {
    P2P_SD_SUCCESS = 0,
    P2P_SD_PROTO_NOT_AVAILABLE = 1,
    P2P_SD_REQUESTED_INFO_NOT_AVAILABLE = 2,
    P2P_SD_BAD_REQUEST = 3
};


enum wifi_display_subelem {
    WFD_SUBELEM_DEVICE_INFO = 0,
    WFD_SUBELEM_ASSOCIATED_BSSID = 1,
    WFD_SUBELEM_AUDIO_FORMATS = 2,
    WFD_SUBELEM_VIDEO_FORMATS = 3,
    WFD_SUBELEM_3D_VIDEO_FORMATS = 4,
    WFD_SUBELEM_CONTENT_PROTECTION = 5,
    WFD_SUBELEM_COUPLED_SINK = 6,
    WFD_SUBELEM_EXT_CAPAB = 7,
    WFD_SUBELEM_LOCAL_IP_ADDRESS = 8,
    WFD_SUBELEM_SESSION_INFO = 9
};

/* 802.11s */
#define MESH_SYNC_METHOD_NEIGHBOR_OFFSET 1
#define MESH_SYNC_METHOD_VENDOR     255
#define MESH_PATH_PROTOCOL_HWMP     1
#define MESH_PATH_PROTOCOL_VENDOR   255
#define MESH_PATH_METRIC_AIRTIME    1
#define MESH_PATH_METRIC_VENDOR     255

enum plink_action_field {
    PLINK_OPEN = 1,
    PLINK_CONFIRM,
    PLINK_CLOSE
};

#define OUI_BROADCOM 0x00904c /* Broadcom (Epigram) */
#define VENDOR_VHT_TYPE     0x04
#define VENDOR_VHT_SUBTYPE  0x08
#define VENDOR_VHT_SUBTYPE2 0x00

#define VENDOR_HT_CAPAB_OUI_TYPE 0x33 /* 00-90-4c:0x33 */

/* cipher suite selectors */
#define WLAN_CIPHER_SUITE_USE_GROUP 0x000FAC00
#define WLAN_CIPHER_SUITE_WEP40     0x000FAC01
#define WLAN_CIPHER_SUITE_TKIP      0x000FAC02
/* reserved:                0x000FAC03 */
#define WLAN_CIPHER_SUITE_CCMP      0x000FAC04
#define WLAN_CIPHER_SUITE_WEP104    0x000FAC05
#define WLAN_CIPHER_SUITE_AES_CMAC  0x000FAC06
#define WLAN_CIPHER_SUITE_NO_GROUP_ADDR 0x000FAC07
#define WLAN_CIPHER_SUITE_GCMP      0x000FAC08
#define WLAN_CIPHER_SUITE_GCMP_256  0x000FAC09
#define WLAN_CIPHER_SUITE_CCMP_256  0x000FAC0A
#define WLAN_CIPHER_SUITE_BIP_GMAC_128  0x000FAC0B
#define WLAN_CIPHER_SUITE_BIP_GMAC_256  0x000FAC0C
#define WLAN_CIPHER_SUITE_BIP_CMAC_256  0x000FAC0D

#define WLAN_CIPHER_SUITE_SMS4      0x00147201

#define WLAN_CIPHER_SUITE_CKIP      0x00409600
#define WLAN_CIPHER_SUITE_CKIP_CMIC 0x00409601
#define WLAN_CIPHER_SUITE_CMIC      0x00409602
#define WLAN_CIPHER_SUITE_KRK       0x004096FF /* for nl80211 use only */

/* AKM suite selectors */
#define WLAN_AKM_SUITE_8021X        0x000FAC01
#define WLAN_AKM_SUITE_PSK      0x000FAC02
#define WLAN_AKM_SUITE_FT_8021X     0x000FAC03
#define WLAN_AKM_SUITE_FT_PSK       0x000FAC04
#define WLAN_AKM_SUITE_8021X_SHA256 0x000FAC05
#define WLAN_AKM_SUITE_PSK_SHA256   0x000FAC06
#define WLAN_AKM_SUITE_8021X_SUITE_B    0x000FAC11
#define WLAN_AKM_SUITE_8021X_SUITE_B_192    0x000FAC12
#define WLAN_AKM_SUITE_CCKM     0x00409600
#define WLAN_AKM_SUITE_OSEN     0x506f9a01


/* IEEE 802.11v - WNM Action field values */
enum wnm_action {
    WNM_EVENT_REQ = 0,
    WNM_EVENT_REPORT = 1,
    WNM_DIAGNOSTIC_REQ = 2,
    WNM_DIAGNOSTIC_REPORT = 3,
    WNM_LOCATION_CFG_REQ = 4,
    WNM_LOCATION_CFG_RESP = 5,
    WNM_BSS_TRANS_MGMT_QUERY = 6,
    WNM_BSS_TRANS_MGMT_REQ = 7,
    WNM_BSS_TRANS_MGMT_RESP = 8,
    WNM_FMS_REQ = 9,
    WNM_FMS_RESP = 10,
    WNM_COLLOCATED_INTERFERENCE_REQ = 11,
    WNM_COLLOCATED_INTERFERENCE_REPORT = 12,
    WNM_TFS_REQ = 13,
    WNM_TFS_RESP = 14,
    WNM_TFS_NOTIFY = 15,
    WNM_SLEEP_MODE_REQ = 16,
    WNM_SLEEP_MODE_RESP = 17,
    WNM_TIM_BROADCAST_REQ = 18,
    WNM_TIM_BROADCAST_RESP = 19,
    WNM_QOS_TRAFFIC_CAPAB_UPDATE = 20,
    WNM_CHANNEL_USAGE_REQ = 21,
    WNM_CHANNEL_USAGE_RESP = 22,
    WNM_DMS_REQ = 23,
    WNM_DMS_RESP = 24,
    WNM_TIMING_MEASUREMENT_REQ = 25,
    WNM_NOTIFICATION_REQ = 26,
    WNM_NOTIFICATION_RESP = 27
};

/* IEEE 802.11v - BSS Transition Management Request - Request Mode */
#define WNM_BSS_TM_REQ_PREF_CAND_LIST_INCLUDED BIT(0)
#define WNM_BSS_TM_REQ_ABRIDGED BIT(1)
#define WNM_BSS_TM_REQ_DISASSOC_IMMINENT BIT(2)
#define WNM_BSS_TM_REQ_BSS_TERMINATION_INCLUDED BIT(3)
#define WNM_BSS_TM_REQ_ESS_DISASSOC_IMMINENT BIT(4)

