china-djyos/djyos/third/firmware/bk7251drv3.0/func/hostapd-2.5/src/common/ieee802_11_defs.h
/* IEEE Std 802.11-2012 - Table 8-253 */
enum bss_trans_mgmt_status_code {
    WNM_BSS_TM_ACCEPT = 0,
    WNM_BSS_TM_REJECT_UNSPECIFIED = 1,
    WNM_BSS_TM_REJECT_INSUFFICIENT_BEACON = 2,
    WNM_BSS_TM_REJECT_INSUFFICIENT_CAPABITY = 3,
    WNM_BSS_TM_REJECT_UNDESIRED = 4,
    WNM_BSS_TM_REJECT_DELAY_REQUEST = 5,
    WNM_BSS_TM_REJECT_STA_CANDIDATE_LIST_PROVIDED = 6,
    WNM_BSS_TM_REJECT_NO_SUITABLE_CANDIDATES = 7,
    WNM_BSS_TM_REJECT_LEAVING_ESS = 8
};

#define WNM_NEIGHBOR_TSF                         1
#define WNM_NEIGHBOR_CONDENSED_COUNTRY_STRING    2
#define WNM_NEIGHBOR_BSS_TRANSITION_CANDIDATE    3
#define WNM_NEIGHBOR_BSS_TERMINATION_DURATION    4
#define WNM_NEIGHBOR_BEARING                     5
#define WNM_NEIGHBOR_MEASUREMENT_PILOT          66
#define WNM_NEIGHBOR_RRM_ENABLED_CAPABILITIES   70
#define WNM_NEIGHBOR_MULTIPLE_BSSID             71

/* QoS action */
enum qos_action {
    QOS_ADDTS_REQ = 0,
    QOS_ADDTS_RESP = 1,
    QOS_DELTS = 2,
    QOS_SCHEDULE = 3,
    QOS_QOS_MAP_CONFIG = 4,
};

/* IEEE Std 802.11-2012, 8.4.2.62 20/40 BSS Coexistence element */
#define WLAN_20_40_BSS_COEX_INFO_REQ            BIT(0)
#define WLAN_20_40_BSS_COEX_40MHZ_INTOL         BIT(1)
#define WLAN_20_40_BSS_COEX_20MHZ_WIDTH_REQ     BIT(2)
#define WLAN_20_40_BSS_COEX_OBSS_EXEMPT_REQ     BIT(3)
#define WLAN_20_40_BSS_COEX_OBSS_EXEMPT_GRNT    BIT(4)

STRUCT_PACKED struct ieee80211_2040_bss_coex_ie {
    u8 element_id;
    u8 length;
    u8 coex_param;
}GCC_PACKED;

STRUCT_PACKED struct ieee80211_2040_intol_chan_report {
    u8 element_id;
    u8 length;
    u8 op_class;
    u8 variable[];  /* Channel List */
}GCC_PACKED;

/* IEEE 802.11v - WNM-Sleep Mode element */
STRUCT_PACKED struct wnm_sleep_element {
    u8 eid;     /* WLAN_EID_WNMSLEEP */
    u8 len;
    u8 action_type; /* WNM_SLEEP_ENTER/WNM_SLEEP_MODE_EXIT */
    u8 status;
    le16 intval;
}GCC_PACKED;

#define WNM_SLEEP_MODE_ENTER 0
#define WNM_SLEEP_MODE_EXIT 1

enum wnm_sleep_mode_response_status {
    WNM_STATUS_SLEEP_ACCEPT = 0,
    WNM_STATUS_SLEEP_EXIT_ACCEPT_GTK_UPDATE = 1,
    WNM_STATUS_DENIED_ACTION = 2,
    WNM_STATUS_DENIED_TMP = 3,
    WNM_STATUS_DENIED_KEY = 4,
    WNM_STATUS_DENIED_OTHER_WNM_SERVICE = 5
};

/* WNM-Sleep Mode subelement IDs */
enum wnm_sleep_mode_subelement_id {
    WNM_SLEEP_SUBELEM_GTK = 0,
    WNM_SLEEP_SUBELEM_IGTK = 1
};

/* Channel Switch modes (802.11h) */
#define CHAN_SWITCH_MODE_ALLOW_TX   0
#define CHAN_SWITCH_MODE_BLOCK_TX   1

STRUCT_PACKED struct tpc_report {
    u8 eid;
    u8 len;
    u8 tx_power;
    u8 link_margin;
}GCC_PACKED;

/* IEEE Std 802.11-2012, 8.5.7.4 - Link Measurement Request frame format */
STRUCT_PACKED struct rrm_link_measurement_request {
    u8 dialog_token;
    s8 tx_power;
    s8 max_tp;
    u8 variable[];
}GCC_PACKED;

/* IEEE Std 802.11-2012, 8.5.7.5 - Link Measurement Report frame format */
STRUCT_PACKED struct rrm_link_measurement_report {
    u8 dialog_token;
    struct tpc_report tpc;
    u8 rx_ant_id;
    u8 tx_ant_id;
    u8 rcpi;
    u8 rsni;
    u8 variable[];
}GCC_PACKED;

#define SSID_MAX_LEN 32

/* IEEE Std 802.11ad-2012 - Multi-band element */
STRUCT_PACKED struct multi_band_ie {
    u8 eid; /* WLAN_EID_MULTI_BAND */
    u8 len;
    u8 mb_ctrl;
    u8 band_id;
    u8 op_class;
    u8 chan;
    u8 bssid[ETH_ALEN];
    le16 beacon_int;
    u8 tsf_offs[8];
    u8 mb_connection_capability;
    u8 fst_session_tmout;
    /* Optional:
     *   STA MAC Address
     *   Pairwise Cipher Suite Count
     *   Pairwise Cipher Suite List
     */
    u8 variable[];
}GCC_PACKED;

enum mb_ctrl_sta_role {
    MB_STA_ROLE_AP = 0,
    MB_STA_ROLE_TDLS_STA = 1,
    MB_STA_ROLE_IBSS_STA = 2,
    MB_STA_ROLE_PCP = 3,
    MB_STA_ROLE_NON_PCP_NON_AP = 4
};

#define MB_CTRL_ROLE_MASK (BIT(0) | BIT(1) | BIT(2))
#define MB_CTRL_ROLE(ctrl) ((u8) ((ctrl) & MB_CTRL_ROLE_MASK))
#define MB_CTRL_STA_MAC_PRESENT ((u8) (BIT(3)))
#define MB_CTRL_PAIRWISE_CIPHER_SUITE_PRESENT ((u8) (BIT(4)))

enum mb_band_id {
    MB_BAND_ID_WIFI_2_4GHZ = 2, /* 2.4 GHz */
    MB_BAND_ID_WIFI_5GHZ = 4, /* 4.9 and 5 GHz */
    MB_BAND_ID_WIFI_60GHZ = 5, /* 60 GHz */
};

#define MB_CONNECTION_CAPABILITY_AP ((u8) (BIT(0)))
#define MB_CONNECTION_CAPABILITY_PCP ((u8) (BIT(1)))
#define MB_CONNECTION_CAPABILITY_DLS ((u8) (BIT(2)))
#define MB_CONNECTION_CAPABILITY_TDLS ((u8) (BIT(3)))
#define MB_CONNECTION_CAPABILITY_IBSS ((u8) (BIT(4)))

/* IEEE Std 802.11ad-2014 - FST Action field */
enum fst_action {
    FST_ACTION_SETUP_REQUEST = 0,
    FST_ACTION_SETUP_RESPONSE = 1,
    FST_ACTION_TEAR_DOWN = 2,
    FST_ACTION_ACK_REQUEST = 3,
    FST_ACTION_ACK_RESPONSE = 4,
    FST_ACTION_ON_CHANNEL_TUNNEL = 5,
};

#endif /* IEEE802_11_DEFS_H */
